Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
random_id.test: Refreshing state... [id=16IJfYliJIc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_ssm_parameter.bar will be created
+ resource "aws_ssm_parameter" "bar" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "foo"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # random_id.test will be destroyed
  # (because random_id.test is not in configuration)
- resource "random_id" "test" {
      - b64_std     = "16IJfYliJIc=" -> null
      - b64_url     = "16IJfYliJIc" -> null
      - byte_length = 8 -> null
      - dec         = "15537992099162104967" -> null
      - hex         = "d7a2097d89622487" -> null
      - id          = "16IJfYliJIc" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
- test = "d7a2097d89622487" -> null
╷
│ Warning: AWS account ID not found for provider
│ 
│   with provider["registry.terraform.io/hashicorp/aws"],
│   on providers.tf line 18, in provider "aws":
│   18: provider "aws" {
│ 
│ See
│ https://registry.terraform.io/providers/hashicorp/aws/latest/docs#skip_requesting_account_id
│ for implications.
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://Takahiros-MacBook-Air.local:4141/lock?id=tkasuz%252Fatlantis-test%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```